{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "41037154-2411-4990-bc69-03354bf12bde",
   "metadata": {},
   "source": [
    "# Features showcase <a target=\"_blank\" href=\"https://colab.research.google.com/github/yWorks/yfiles-jupyter-graphs-for-kuzu/blob/kuzu/examples/features.ipynb\"><img src=\"https://colab.research.google.com/assets/colab-badge.svg\" alt=\"Open In Colab\"/></a>\n",
    "\n",
    "This notebook shows some features of `yfiles-jupyter-graphs-for-kuzu`."
   ]
  },
  {
   "cell_type": "markdown",
   "id": "7cc289eb-70a1-4e4f-9298-7703edd1dcd0",
   "metadata": {},
   "source": [
    "## Install required dependencies"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "id": "e97e1835-1e70-43aa-8409-c57ab7f4dadf",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Note: you may need to restart the kernel to use updated packages.\n",
      "Note: you may need to restart the kernel to use updated packages.\n",
      "Note: you may need to restart the kernel to use updated packages.\n"
     ]
    }
   ],
   "source": [
    "%pip install kuzu --quiet\n",
    "#%pip install yfiles_jupyter_graphs_for_kuzu --quiet\n",
    "%pip install real_ladybug --quiet\n",
    "%pip install pandas --quiet"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "383f8116-a8fd-418e-b558-db4c7911cd6b",
   "metadata": {},
   "source": [
    "You can also open this notebook in Google Colab when Google Colab's custom widget manager is enabled:"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "id": "c36b2a86-6e5f-41c8-8139-ac41e40de26b",
   "metadata": {},
   "outputs": [],
   "source": [
    "try:\n",
    "  import google.colab\n",
    "  from google.colab import output\n",
    "  output.enable_custom_widget_manager()\n",
    "except:\n",
    "  pass"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "fdb6bfce-2451-449a-bad5-75cabb037ba4",
   "metadata": {},
   "source": [
    "## Download sample data\n",
    "\n",
    "For demonstration purpose, download some sample data from [kuzudb.com](https://kuzudb.com) and create a local database with it."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "id": "c53de0f4-fc1d-49e4-bf5d-cb3f40fb8cd7",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Downloaded city.csv\n",
      "Downloaded user.csv\n",
      "Downloaded follows.csv\n",
      "Downloaded lives-in.csv\n"
     ]
    }
   ],
   "source": [
    "import requests\n",
    "\n",
    "urls = [\n",
    "    \"https://raw.githubusercontent.com/ladybugdb/ladybug/refs/heads/master/dataset/demo-db/csv/city.csv\",\n",
    "    \"https://raw.githubusercontent.com/ladybugdb/ladybug/refs/heads/master/dataset/demo-db/csv/user.csv\",\n",
    "    \"https://raw.githubusercontent.com/ladybugdb/ladybug/refs/heads/master/dataset/demo-db/csv/follows.csv\",\n",
    "    \"https://raw.githubusercontent.com/ladybugdb/ladybug/refs/heads/master/dataset/demo-db/csv/lives-in.csv\"\n",
    "]\n",
    "\n",
    "for url in urls:\n",
    "    filename = url.split(\"/\")[-1]\n",
    "    response = requests.get(url)\n",
    "    with open(filename, 'wb') as f:\n",
    "        f.write(response.content)\n",
    "    print(f\"Downloaded {filename}\")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "137f93c8-94b9-4cb2-adfe-51a1976e0ffb",
   "metadata": {},
   "source": [
    "## Create sample database\n",
    "\n",
    "Use the dowloaded CSV files to create a sample database."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "009062df-2695-490a-8ba6-80e05dfd6752",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<real_ladybug.query_result.QueryResult at 0x28fa8786750>"
      ]
     },
     "execution_count": 3,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "import real_ladybug as lb\n",
    "\n",
    "# Create an empty on-disk database and connect to it\n",
    "db = lb.Database(\"demo-db2.lbug\")\n",
    "conn = lb.Connection(db)\n",
    "\n",
    "# Create schema\n",
    "conn.execute(\"CREATE NODE TABLE User(name STRING PRIMARY KEY, age INT64)\")\n",
    "conn.execute(\"CREATE NODE TABLE City(name STRING PRIMARY KEY, population INT64)\")\n",
    "conn.execute(\"CREATE REL TABLE Follows(FROM User TO User, since INT64)\")\n",
    "conn.execute(\"CREATE REL TABLE LivesIn(FROM User TO City)\")\n",
    "\n",
    "# Insert data\n",
    "conn.execute('COPY User FROM \"./user.csv\"')\n",
    "conn.execute('COPY City FROM \"./city.csv\"')\n",
    "conn.execute('COPY Follows FROM \"./follows.csv\"')\n",
    "conn.execute('COPY LivesIn FROM \"./lives-in.csv\"')"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "8673ba9e-4f9c-40e8-83b3-fe0bdab47338",
   "metadata": {},
   "source": [
    "# Default, no-config visualization\n",
    "\n",
    "Easily visualize the result of a query."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "46ea57cc-f2a1-460e-a7ed-f781b89b8fb7",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Executing Cypher query: MATCH (a:User)-[f:Follows]->(b:User) RETURN a, f, b\n"
     ]
    },
    {
     "data": {
      "application/vnd.jupyter.widget-view+json": {
       "model_id": "cec222b9a9a44bb4b1ce88fcfce5f547",
       "version_major": 2,
       "version_minor": 0
      },
      "text/plain": [
       "GraphWidget(layout=Layout(height='500px', width='100%'))"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "from yfiles_jupyter_graphs_for_kuzu import KuzuGraphWidget\n",
    "g = KuzuGraphWidget(conn)\n",
    "g.show_cypher('MATCH (a:User)-[f:Follows]->(b:User) RETURN a, f, b')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "b9246382-5d74-4e54-a496-c851569fe76a",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.11.11"
  },
  "widgets": {
   "application/vnd.jupyter.widget-state+json": {
    "state": {},
    "version_major": 2,
    "version_minor": 0
   }
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
